let birthYear = Number(prompt("Введіть свій рік народження:", 1990));
let city = prompt("Введіть назву міста в якому проживаєте", 'Лондон');
let sport = prompt("Вкажіть свій улюбленний вид спорту", 'Теніс');
let year = 2024;
let age;

if (birthYear && birthYear > 1900) {
    age = year - birthYear + ' роки';
}
else if (birthYear < 1990 || birthYear <= 0 || birthYear > 2024) {
    age = "Шкода,що ви не захотіли вводити свій реальний рік народження.";
}
else {
    age = "Шкода,що ви не захотіли вводити свій рік народження.";
}

if (city == "Лондон" || city == "Київ" || city == "Вашингтон") {
    city = 'Ти живеш у столиці ' + city;
}
else if (city == "" || city == 0) {
    city = "Шкода,що ви не захотіли вводити місто в якому проживаєте.";
}
else {
    city = 'Ти живеш у  місті ' + city;
}


if (sport == "Теніс") {
    sport += " круто! Хочеш стати як Рафае́ль Нада́ль?"
} else if (sport == "Футбол") {
    sport += " круто! Хочеш стати як Ліонель Мессі ? "
}
else if (sport == "Плавання") {
    sport += " круто! Хочеш стати як Кемерон Макевой ? "
}
else if (sport == "" || sport == 0) {
    sport = "Шкода,що ви не захотіли вводити свій улюбленний вид спорту."
}
else {
    sport += " круто!"
}

alert(`${age}
${city}.
${sport}`);